Revit 2027 API
ScheduleDefinition.ShowHeaders Property
 Indicates if the headers will be displayed in the schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowHeaders { get; set; }
Public Property ShowHeaders As Boolean
	Get
	Set
public:
property bool ShowHeaders {
	bool get ();
	void set (bool value);
}
member ShowHeaders : bool with get, set
Property Value
Boolean
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace